# BuildingClosingTimeParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BuildingClosingTimeParam Property
ParameterTypeId Class See Also
---
"Closing Time"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BuildingClosingTimeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuildingClosingTimeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BuildingClosingTimeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace